backend/Enums/ВремяЗаезда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВремяЗаезда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>После12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>После13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>После14</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

backend/Enums/ВремяВыезда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВремяВыезда</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыездДо12</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыездДо13</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыездДо14</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

backend/Enums/КоличествоКомнат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>КоличествоКомнат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОднаКомната</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДвеКомнаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТриКоманты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоКомнат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

backend/Enums/КоличествоМест.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>КоличествоМест</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляТрехГостей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляДвухГостей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляОдногоГостя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеДляГостей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

backend/Enums/ВидыЖилья.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыЖилья</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Квартира</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лачуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дворец</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

backend/Enums/ВидыУдобств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ВидыУдобств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>WiFi</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кухня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Парковка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стиралка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Лифт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кондиционер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

backend/CommonModules/Конверторы/Ext/Module.bsl
Функция СтрокаВВремяЗаезда(ВремяЗаезда) Экспорт
	
	Если ВремяЗаезда = "12:00" Тогда
		Возврат Перечисления.ВремяЗаезда.После12;
	ИначеЕсли ВремяЗаезда = "13:00" Тогда
		Возврат Перечисления.ВремяЗаезда.После13;		
	ИначеЕсли ВремяЗаезда = "14:00" Тогда
		Возврат Перечисления.ВремяЗаезда.После14;
	КонецЕсли;
	
	Возврат Перечисления.ВремяЗаезда.ПустаяСсылка();
	
КонецФункции

Функция СтрокаВВремяВыезда(ВремяВыезда) Экспорт
	
	Если ВремяВыезда = "12:00" Тогда
		Возврат Перечисления.ВремяВыезда.ВыездДо12;
	ИначеЕсли ВремяВыезда = "13:00" Тогда
		Возврат Перечисления.ВремяВыезда.ВыездДо13;
	ИначеЕсли ВремяВыезда = "14:00" Тогда
		Возврат Перечисления.ВремяВыезда.ВыездДо14;
	КонецЕсли;
	
	Возврат Перечисления.ВремяВыезда.ПустаяСсылка();
	
КонецФункции

Функция СтрокаВКоличествоКомнат(КоличествоКомнат) Экспорт
	
	Если КоличествоКомнат = 1 Тогда
		Возврат Перечисления.КоличествоКомнат.ОднаКомната;
	ИначеЕсли КоличествоКомнат = 2 Тогда
		Возврат Перечисления.КоличествоКомнат.ДвеКомнаты;
	ИначеЕсли КоличествоКомнат = 3 Тогда
		Возврат Перечисления.КоличествоКомнат.ТриКоманты;
	ИначеЕсли КоличествоКомнат = 100 Тогда
		Возврат Перечисления.КоличествоКомнат.СтоКомнат;
	КонецЕсли;
	
	Возврат Перечисления.КоличествоКомнат.ПустаяСсылка();
	
КонецФункции

Функция СтрокаВКоличествоМест(КоличествоМест) Экспорт
	
	Если КоличествоМест = 1 Тогда
		Возврат Перечисления.КоличествоМест.ДляОдногоГостя;
	ИначеЕсли КоличествоМест = 2 Тогда
		Возврат Перечисления.КоличествоМест.ДляДвухГостей;
	ИначеЕсли КоличествоМест = 3 Тогда
		Возврат Перечисления.КоличествоМест.ДляТрехГостей;
	КонецЕсли;
	
	Возврат Перечисления.КоличествоМест.НеДляГостей;	
	
КонецФункции

Функция СтрокаВВидЖилья(ВидЖилья) Экспорт
	
	ВидыЖилья = Новый Структура;
	ВидыЖилья.Вставить("bungalo", Перечисления.ВидыЖилья.Лачуга);
	ВидыЖилья.Вставить("flat", Перечисления.ВидыЖилья.Квартира);
	ВидыЖилья.Вставить("house", Перечисления.ВидыЖилья.Дом);
	ВидыЖилья.Вставить("palace", Перечисления.ВидыЖилья.Дворец);
		
	Возврат ВидыЖилья[ВидЖилья];
	
КонецФункции

Функция СтрокаВВидУдобства(Опция) Экспорт
	
	ВидыУдобств = Новый Структура;
	ВидыУдобств.Вставить("wifi", Перечисления.ВидыУдобств.WiFi);
	ВидыУдобств.Вставить("citchen", Перечисления.ВидыУдобств.Кухня);
	ВидыУдобств.Вставить("parking", Перечисления.ВидыУдобств.Парковка);
	ВидыУдобств.Вставить("dishwasher", Перечисления.ВидыУдобств.Стиралка);
	ВидыУдобств.Вставить("elevator", Перечисления.ВидыУдобств.Лифт);
	ВидыУдобств.Вставить("conditioner", Перечисления.ВидыУдобств.Кондиционер);
	
	Возврат ВидыУдобств[Опция];
	
КонецФункции

Функция ВремяЗаездаВСтроку(ВремяЗаезда) Экспорт
	
	Если ВремяЗаезда = Перечисления.ВремяЗаезда.После12 Тогда
		Возврат "12:00";
	ИначеЕсли ВремяЗаезда = Перечисления.ВремяЗаезда.После13 Тогда
		ВОзврат "13:00";
	ИначеЕсли ВремяЗаезда = Перечисления.ВремяЗаезда.После14 Тогда
		Возврат "14:00";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ВремяВыездаВСтроку(ВремяВыезда) Экспорт
	
	Если ВремяВыезда = Перечисления.ВремяВыезда.ВыездДо12 Тогда
		Возврат "12:00";
	ИначеЕсли ВремяВыезда = Перечисления.ВремяВыезда.ВыездДо13 Тогда
		Возврат "13:00";
	ИначеЕсли ВремяВыезда = Перечисления.ВремяВыезда.ВыездДо14 Тогда
		Возврат "14:00";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция КоличествоКомнатВЧисло(КоличествоКомнат) Экспорт
	
	Если КоличествоКомнат = Перечисления.КоличествоКомнат.ОднаКомната Тогда
		Возврат 1;
	ИначеЕсли КоличествоКомнат = Перечисления.КоличествоКомнат.ДвеКомнаты Тогда
		Возврат 2;
	ИначеЕсли КоличествоКомнат = Перечисления.КоличествоКомнат.ТриКоманты Тогда
		Возврат 3;
	ИначеЕсли КоличествоКомнат = Перечисления.КоличествоКомнат.СтоКомнат Тогда
		Возврат 100;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция КоличествоМестВЧисло(КоличествоМест) Экспорт
	
	Если КоличествоМест = Перечисления.КоличествоМест.ДляДвухГостей Тогда
		Возврат 2;
	ИначеЕсли КоличествоМест = Перечисления.КоличествоМест.ДляОдногоГостя Тогда
		Возврат 1;
	ИначеЕсли КоличествоМест = Перечисления.КоличествоМест.ДляТрехГостей Тогда
		Возврат 3;
	ИначеЕсли КоличествоМест = Перечисления.КоличествоМест.НеДляГостей Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат 0;		
	
КонецФункции

Функция ВидЖильяВСтроку(ВидЖилья) Экспорт
	
	Если ВидЖилья = Перечисления.ВидыЖилья.Дворец Тогда
		Возврат "palace";
	ИначеЕсли ВидЖилья = Перечисления.ВидыЖилья.Дом Тогда
		Возврат "house";
	ИначеЕсли ВидЖилья = Перечисления.ВидыЖилья.Квартира Тогда
		Возврат "flat";
	ИначеЕсли ВидЖилья = Перечисления.ВидыЖилья.Лачуга Тогда
		Возврат "bungalo";	
	КонецЕсли;
		
	Возврат "unknown";
	
КонецФункции

Функция ВидУдобстваВСтроку(Опция) Экспорт
	
	Если Опция = Перечисления.ВидыУдобств.WiFi Тогда
		Возврат "wifi";
	ИначеЕсли Опция = Перечисления.ВидыУдобств.Кондиционер Тогда
		Возврат "conditioner";
	ИначеЕсли Опция = Перечисления.ВидыУдобств.Кухня Тогда
		Возврат "citchen";
	ИначеЕсли Опция = Перечисления.ВидыУдобств.Лифт Тогда
		Возврат "elevator";
	ИначеЕсли Опция = Перечисления.ВидыУдобств.Парковка Тогда
		Возврат "parking";
	ИначеЕсли Опция = Перечисления.ВидыУдобств.Стиралка ТОгда
		Возврат "dishwasher";
	КонецЕсли;
	
	Возврат "unknown";
	
КонецФункции

Функция СервисВСтруктуру(Сервис) Экспорт
	
	Результат = ОбщегоНазначения.ПолучитьБазовуюСтруктуруОтвета();
	
	Результат.id = Строка(Сервис.Ссылка.УникальныйИдентификатор());
	
	Результат.author.avatar = Сервис.ПутьКАватарке;
	Результат.offer.title = СокрЛП(Сервис.Наименование);
	Результат.offer.address = СокрЛП(Сервис.Адрес);
	Результат.offer.price = Сервис.ЦенаЗаНочь;
	Результат.offer.type = ВидЖильяВСтроку(Сервис.ВидЖилья);
	Результат.offer.rooms = КоличествоКомнатВЧисло(Сервис.КоличествоКомнат);
	Результат.offer.guests = КоличествоМестВЧисло(Сервис.КоличествоМест);
	Результат.offer.checkin = ВремяЗаездаВСтроку(Сервис.ВремяЗаезда);
	Результат.offer.checkout = ВремяВыездаВСтроку(Сервис.ВремяВыезда);
	Результат.offer.description = СокрЛП(Сервис.Описание);
	Результат.location.x = Сервис.КоординатаХ;
	Результат.location.y = Сервис.КоординатаУ;
	
	Для Каждого ВидУдобства Из Сервис.Ссылка.ВидыУдобств Цикл
		Результат.offer.features.Добавить(ВидУдобстваВСтроку(ВидУдобства.Опция));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
